configuration/Documents/_ДвиженияКарточки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>_ДвиженияКарточки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister._СостояниеКарточек</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантДвиженийДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef._ВариантыДвиженийДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Карточка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРеквизита</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef._ВидыРеквизитов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД_Элемента</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеРеквизита</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеАктивно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

configuration/InformationRegisters/_СостояниеКарточек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>_СостояниеКарточек</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic._ВидыРеквизитов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеАктивно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРеквизита</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Карточка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef._Карточки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_Элемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

configuration/Enums/_ВариантыДвиженийДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>_ВариантыДвиженийДокумента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДатойДокумента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущимВременем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

configuration/Documents/_ДвиженияКарточки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движение_СостояниеКарточек(Отказ, Режим);
	
	Если не Отказ Тогда
		Движения._СостояниеКарточек.Записать(Ложь); 
	КонецЕсли;
КонецПроцедуры 


// Процедура Движение_СостояниеЗадач(Отказ, Режим)
// Назначение:
//   Центральная процедура модуля. Формирует движения в периодическом
//   регистре сведений аск_СостояниеЗадач, который хранит текущее состояние
//   каждого "хранимого" реквизита Задачи (набор реквизитов определяется
//   видом задачи - ОсновнаяЗадача.ВидЗадачи.РеквизитыХранимые) в разрезе
//   Аналитика1/Аналитика2/Основание/Задача/ВидЗадачи.
//   Кроме того, по мере обработки реквизитов:
//     - если встречается реквизит "СтатусОбъекта" - параллельно создаёт
//       движение по регистру аск_СтатусыВыполнения (тип объекта зависит от
//       типа Основания задачи: ОчередиБлагоустройства/ИнженерныеСистемы/
//       ОбъектНедвижимости);
//     - если встречается реквизит "СтатусЗадачи" - дополнительно
//       автоматически формирует служебный реквизит "Статус_БП"
//       (бизнес-процесс) со значением "Закрыт"/"ВРаботе";
//     - в конце проверяет, что все обязательные реквизиты вида задачи
//       заполнены, иначе - ВызватьИсключение и Отказ = Истина.
//   Общая идея: подзадача может явно заполнить только часть реквизитов
//   (в своей табличной части "Реквизиты"), остальные "наследуются" из
//   предыдущего среза (ТекущиеЗначения) либо (если это первая подзадача по
//   задаче) - из самой Задачи.
Процедура Движение_СостояниеКарточек(Отказ, Режим)
	Если ЭтотОбъект.ДополнительныеСвойства.БылПроведенПередЗаписью Тогда
		Возврат;
	КонецЕсли;
	
	//1. Готовлю таблицу движений. 
	//   В табличной части могут присутствоать несколько строк для одного набора измерений, нужно брать последнее.
	
	ПодготовкаДвижений = новый Соответствие; 
	// Массив-соответствие по карточкам.
	// Цель: сгруппировать движения по карточкам. 
	// Нужно предусмотреть запрет создания возможности создания в один момент времени двеижений для одинакового набора измерений. буду контролировать время движения карточки
	// Сответствие(Карточка) -> Соответствие(ВидРеквизита+УИД_Элемента) -> Структура("Карточка,ВидРеквизита,УИД_Элемента,ЗначениеРеквизита,ЗначениеАктивно")

	тКарточка = "НевозможноеЗначение";
	Для Каждого ТекСтрокаРеквизиты Из Реквизиты Цикл
		//Если тКарточка <> ТекСтрокаРеквизиты.Карточка Тогда
		//   тКарточка = ТекСтрокаРеквизиты.Карточка;
		//КонецЕсли;
		
		//Если элемент для карточки не создан - создаю
		тСтрКарточка = ПодготовкаДвижений.Получить(ТекСтрокаРеквизиты.Карточка);
		Если тСтрКарточка = Неопределено Тогда
			тСтрКарточка = Новый Соответствие;
			ПодготовкаДвижений.Вставить(ТекСтрокаРеквизиты.Карточка,тСтрКарточка);
		КонецЕсли;
		
		// Вставляю структуру движения, если такаю была, то новая заменит.
		КлючДля_тСтрВидРеквизита = ""+ТекСтрокаРеквизиты.ВидРеквизита.УникальныйИдентификатор()+"/"+ТекСтрокаРеквизиты.УИД_Элемента;
		СтруктураДвижения = Новый Структура("Карточка,ВидРеквизита,УИД_Элемента,ЗначениеРеквизита,ЗначениеАктивно");
		ЗаполнитьЗначенияСвойств(СтруктураДвижения,ТекСтрокаРеквизиты);
			
		тСтрКарточка.Вставить(КлючДля_тСтрВидРеквизита,СтруктураДвижения);
	КонецЦикла;	
	
	//2. Делаю записи только для изменившихся значений.
	Для Каждого тСтрКарточка из ПодготовкаДвижений Цикл
		Если ЭтотОбъект.ВариантДвиженийДокумента = Перечисления._ВариантыДвиженийДокумента.ТекущимВременем Тогда
			Отбор_ИсторияДвижении = Новый Структура;
			Отбор_ИсторияДвижении.Вставить("Карточка",тСтрКарточка.Ключ);		
			ИсторияДвижении = РегистрыСведений._СостояниеКарточек.СрезПоследних(,Отбор_ИсторияДвижении); 
			Если ИсторияДвижении.Количество() <> 0 Тогда   
				ИсторияДвижении.Сортировать("Период Убыв");
				ВремяПоследнейЗаписи = ИсторияДвижении[0].Период +1;
			КонецЕсли;    
			Движение_Период = Макс(ВремяПоследнейЗаписи,ЭтотОбъект.Дата); //Чтобы не было ошибки в регистре при проведении двух подзадач(старой и новой одновременно происходит)
		Иначе //Движения делаются датой документа
		   	Движение_Период = ЭтотОбъект.Дата;
		КонецЕсли;	
		
		Для Каждого СтруктураДвижения из тСтрКарточка.Значение Цикл
			Движение = Движения._СостояниеКарточек.Добавить();
			Движение.Период = Движение_Период;
			ЗаполнитьЗначенияСвойств(Движение,СтруктураДвижения.Значение);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ЭтотОбъект.ДополнительныеСвойства.вставить("БылПроведенПередЗаписью",ЭтотОбъект.Проведен);
	
	Если НЕ ЭтотОбъект.Проведен Тогда
		ЭтотОбъект.Дата = ТекущаяДата();
		 
		Для Каждого ТекСтрокаРеквизиты Из Реквизиты Цикл
			Если ТекСтрокаРеквизиты.ВидРеквизита.ЭтоСписок
			   И ТекСтрокаРеквизиты.ЗначениеАктивно
			   И НЕ ЗначениеЗаполнено(ТекСтрокаРеквизиты.УИД_Элемента)
			Тогда
				ТекСтрокаРеквизиты.УИД_Элемента = новый УникальныйИдентификатор;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
